Revit 2027 API
TaskDialog.Id Property
 The Id of the task dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Id { get; set; }
Public Property Id As String
	Get
	Set
public:
property String^ Id {
	String^ get ();
	void set (String^ value);
}
member Id : string with get, set
Property Value
String
Remarks
 Id is used as follows:
 TaskDialogShowingEventArgs.DialogId for DialogBoxShowing events
 As part of the Contextual Help Topic when invoking Revit contextual help
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace